LKHD045/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Power-law fluid (LK-1): K=1.352e-2 Pa·s^n, n=0.567, rho=8020 kg/m^3
// Effective kinematic viscosity at representative shear rate (~10 s^-1).
// Note: full power-law physics via momentumTransport generalisedNewtonian
// is not yet supported with RAS turbulence in OF11.
viscosityModel  constant;

nu              [0 2 -1 0 0 0 0] 1.686e-6;

// ************************************************************************* //
