LKHD045/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  powerLaw;

powerLawCoeffs
{
    // k = K/rho = 1.352e-2 / 8020  [m^2/s^n]
    // K から変換: μ = 1.5e-3 * u^(-0.433) [mPa·s, u=tip speed m/s]
    //   → γ̇ = 2u/R = 160u [1/s] (R=0.0125m, 無限媒体Couette近似)
    //   → K = 1.5e-3 * 160^0.433 = 1.352e-2 Pa·s^n
    k       [0 2 -1 0 0 0 0] 1.686e-06;
    n       [0 0  0 0 0 0 0] 0.567;
    nuMin   [0 2 -1 0 0 0 0] 1e-09;
    nuMax   [0 2 -1 0 0 0 0] 1e-04;
}

// ************************************************************************* //
