LKHD045/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            symmetry;
    }
    reactor_HD0.45
    {
        type            noSlip;
    }
    shaft_HD0.45
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    impeller_HD0.45
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    baffle_HD0.45
    {
        type            noSlip;
    }
    AMI1
    {
        type            movingWallSlipVelocity;
        value           uniform (0 0 0);
    }
    AMI2
    {
        type            movingWallSlipVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
