LKHD045/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            symmetry;
    }
    reactor_HD0.45
    {
        type            zeroGradient;
    }
    shaft_HD0.45
    {
        type            zeroGradient;
    }
    impeller_HD0.45
    {
        type            zeroGradient;
    }
    baffle_HD0.45
    {
        type            zeroGradient;
    }
    AMI1
    {
        type            zeroGradient;
    }
    AMI2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
