LKHD045/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.0064;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            symmetry;
    }
    reactor_HD0.45
    {
        type            kqRWallFunction;
        value           uniform 0.0064;
    }
    shaft_HD0.45
    {
        type            kqRWallFunction;
        value           uniform 0.0064;
    }
    impeller_HD0.45
    {
        type            kqRWallFunction;
        value           uniform 0.0064;
    }
    baffle_HD0.45
    {
        type            kqRWallFunction;
        value           uniform 0.0064;
    }
    AMI1
    {
        type            zeroGradient;
    }
    AMI2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
