LKHD045/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver      GAMG;
        smoother    DIC;
        tolerance   1e-06;
        relTol      0.01;
    }

    MeshPhi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }
    
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;

        tolerance       1e-6;
        relTol          0;
    }

    "pcorr.*"
    {
        $p;

        tolerance       1e-2;
        relTol          0;

    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
    PhiRefPoint   (0 0.06 0.15);
    PhiRefValue  0;
    pRefPoint    (0 0.06 0.15);
    pRefValue   0;
}

PIMPLE
{
    momentumPredictor   yes;
    correctPhi          yes;
    correctMeshPhi      no;
    nOuterCorrectors    7;
    nCorrectors         4;
    nNonOrthogonalCorrectors 3;
    pRefPoint    (0 0.06 0.15);
    pRefValue   0;
}

relaxationFactors
{
    equations
    {
       ".*"       1;
    }
}


// ************************************************************************* //
