LKHD045/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
internalFacesOnly true;

// Baffles to create.
// NOTE (OpenFOAM 11): cyclicAMI は非サポート。
// createBaffles で patch 型を作成し、後で createNonConformalCouples で NCC に変換する。
baffles
{
    rotation_HD0.45
    {
        type        faceZone;
        zoneName    rotating;

        patches
        {
            owner
            {
                name            AMI1;
                type            patch;
            }

            neighbour
            {
                name            AMI2;
                type            patch;
            }
        }
    }
}


// ************************************************************************* //
