LKHD045/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// includedAngle:
// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges

reactor_HD0.45.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    writeObj            no;
}

impeller_HD0.45.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    writeObj            no;
}

baffle_HD0.45.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    writeObj            no;
}

shaft_HD0.45.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    writeObj            no;
}

rotation_HD0.45.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    writeObj            no;
}
// ************************************************************************* //
